{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel-workshop/multilevel-workshop2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Feb 2023, 12:20:27
{txt}
{com}. //_1
. display c(current_date)
{res} 8 Feb 2023
{txt}
{com}. //_2
. display c(current_time)
{res}12:20:27
{txt}
{com}. //_3q
. clear all
{res}{txt}
{com}. 
. quietly: cd "/Users/agrogan/Desktop/GitHub/multilevel-workshop/"
{txt}
{com}. //_4
. use "../multilevel-thinking/simulate-and-analyze-multilevel-data/simulated_multilevel_longitudinal_data.dta", clear
{txt}
{com}. //_5
. * mixed outcome t warmth physical_punishment || _all: R.country || _all: R.id
.     
. * est store crossed1
. //_6
. mixed outcome t warmth physical_punishment || country: || id:  // 3 level w/ random intercepts only
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -28539.38}  
{res}{txt}Iteration 1:{space 3}log likelihood = {res:-28539.351}  
{res}{txt}Iteration 2:{space 3}log likelihood = {res:-28539.351}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}     9,000

{txt}{col 9}Grouping information
{col 9}{hline 16}{c TT}{hline 44}
{col 25}{c |}{col 31}No. of{col 44}Observations per group
{col 10}Group variable{col 25}{c |}{col 31}groups{col 41}Minimum{col 52}Average{col 63}Maximum
{col 9}{hline 16}{c +}{hline 44}
{res}{col 17}country{txt}{col 25}{c |}{res}{col 29}      30{col 39}      300{col 50}    300.0{col 61}      300
{col 22}id{txt}{col 25}{c |}{res}{col 29}   3,000{col 39}        3{col 50}      3.0{col 61}        3
{txt}{col 9}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}3{txt}){col 67}={col 70}{res}  2024.27
{txt}Log likelihood = {res}-28539.351{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            outcome{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}t {c |}{col 21}{res}{space 2} .9929052{col 33}{space 2} .0658231{col 44}{space 1}   15.08{col 53}{space 3}0.000{col 61}{space 4} .8638943{col 74}{space 3} 1.121916
{txt}{space 13}warmth {c |}{col 21}{res}{space 2} 1.046658{col 33}{space 2} .0302211{col 44}{space 1}   34.63{col 53}{space 3}0.000{col 61}{space 4} .9874255{col 74}{space 3}  1.10589
{txt}physical_punishment {c |}{col 21}{res}{space 2}-.9408357{col 33}{space 2}  .038315{col 44}{space 1}  -24.56{col 53}{space 3}0.000{col 61}{space 4}-1.015932{col 74}{space 3}-.8657397
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 51.22801{col 33}{space 2} .3936058{col 44}{space 1}  130.15{col 53}{space 3}0.000{col 61}{space 4} 50.45655{col 74}{space 3} 51.99946
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} 3.676187{col 44} .9946793{col 58} 2.163142{col 70} 6.247558
{txt}{hline 29}{c +}{hline 48}
{res}id{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} 8.923072{col 44} .4830621{col 58} 8.024786{col 70}  9.92191
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33}   25.996{col 44} .4746206{col 58} 25.08221{col 70} 26.94308
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}1339.33{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}.     
. est store threelevel // store random intercept model
{txt}
{com}. //_7
. mixed outcome t warmth physical_punishment || _all: R.country || id:
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -28539.38}  
{res}{txt}Iteration 1:{space 3}log likelihood = {res:-28539.351}  
{res}{txt}Iteration 2:{space 3}log likelihood = {res:-28539.351}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}     9,000

{txt}{col 9}Grouping information
{col 9}{hline 16}{c TT}{hline 44}
{col 25}{c |}{col 31}No. of{col 44}Observations per group
{col 10}Group variable{col 25}{c |}{col 31}groups{col 41}Minimum{col 52}Average{col 63}Maximum
{col 9}{hline 16}{c +}{hline 44}
{res}{col 20}_all{txt}{col 25}{c |}{res}{col 29}       1{col 39}    9,000{col 50}  9,000.0{col 61}    9,000
{col 22}id{txt}{col 25}{c |}{res}{col 29}   3,000{col 39}        3{col 50}      3.0{col 61}        3
{txt}{col 9}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}3{txt}){col 67}={col 70}{res}  2024.27
{txt}Log likelihood = {res}-28539.351{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            outcome{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}t {c |}{col 21}{res}{space 2} .9929052{col 33}{space 2} .0658231{col 44}{space 1}   15.08{col 53}{space 3}0.000{col 61}{space 4} .8638943{col 74}{space 3} 1.121916
{txt}{space 13}warmth {c |}{col 21}{res}{space 2} 1.046658{col 33}{space 2} .0302211{col 44}{space 1}   34.63{col 53}{space 3}0.000{col 61}{space 4} .9874255{col 74}{space 3}  1.10589
{txt}physical_punishment {c |}{col 21}{res}{space 2}-.9408357{col 33}{space 2}  .038315{col 44}{space 1}  -24.56{col 53}{space 3}0.000{col 61}{space 4}-1.015932{col 74}{space 3}-.8657397
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 51.22801{col 33}{space 2} .3936058{col 44}{space 1}  130.15{col 53}{space 3}0.000{col 61}{space 4} 50.45655{col 74}{space 3} 51.99946
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}_all{txt}: Identity{col 30}{c |}
{col 15}var(R.country){col 30}{c |}{res}{col 33} 3.676187{col 44} .9946793{col 58} 2.163142{col 70} 6.247558
{txt}{hline 29}{c +}{hline 48}
{res}id{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} 8.923072{col 44} .4830621{col 58} 8.024786{col 70}  9.92191
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33}   25.996{col 44} .4746206{col 58} 25.08221{col 70} 26.94308
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}1339.33{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}.     
. est store crossed2 // store crossed effects result
{txt}
{com}. //_8
. est table threelevel crossed2, ///
> b(%9.3f) star stats(N ll chi2) ///
> varwidth(20) modelwidth(15)
{res}
{txt}{hline 20}{c -}{c TT}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{ralign 20:Variable} {c |} {center 18:threelevel} {space 1} {center 18:crossed2} {space 1}
{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}outcome              {txt}{c |}{res}
{txt}{space 19}t {c |}{res} {ralign 15:0.993}{lalign 3:***}{txt} {space 1}{res} {ralign 15:0.993}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 14}warmth {c |}{res} {ralign 15:1.047}{lalign 3:***}{txt} {space 1}{res} {ralign 15:1.047}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 1}physical_punishment {c |}{res} {ralign 15:-0.941}{lalign 3:***}{txt} {space 1}{res} {ralign 15:-0.941}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 15}_cons {c |}{res} {ralign 15:51.228}{lalign 3:***}{txt} {space 1}{res} {ralign 15:51.228}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lns1_1_1             {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:0.651}{lalign 3:***}{txt} {space 1}{res} {ralign 15:0.651}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lns2_1_1             {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:1.094}{lalign 3:***}{txt} {space 1}{res} {ralign 15:1.094}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lnsig_e              {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:1.629}{lalign 3:***}{txt} {space 1}{res} {ralign 15:1.629}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{lalign 20:Statistics}{txt} {c |} {center 18:} {space 1} {center 18:} {space 1}
{res}{txt}{ralign 20:N} {c |}{res} {ralign 15:9000}{lalign 3:}{txt} {space 1}{res} {ralign 15:9000}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 20:ll} {c |}{res} {ralign 15:-2.85e+04}{lalign 3:}{txt} {space 1}{res} {ralign 15:-2.85e+04}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 20:chi2} {c |}{res} {ralign 15:2024.272}{lalign 3:}{txt} {space 1}{res} {ralign 15:2024.272}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c BT}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{ralign 64:Legend: * p<0.05; ** p<0.01; *** p<0.001}
{res}{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel-workshop/multilevel-workshop2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Feb 2023, 12:21:02
{txt}{.-}
{smcl}
{txt}{sf}{ul off}