{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel-workshop/multilevel-workshop2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Apr 2023, 10:50:27
{txt}
{com}. //_1
. display c(current_date)
{res}20 Apr 2023
{txt}
{com}. //_2
. display c(current_time)
{res}10:50:27
{txt}
{com}. //_3q
. clear all
{res}{txt}
{com}. 
. quietly: cd "/Users/agrogan/Desktop/GitHub/multilevel-workshop/"
{txt}
{com}. //_4
. use "../multilevel-thinking/simulate-and-analyze-multilevel-data/simulated_multilevel_longitudinal_data.dta", clear
{txt}
{com}. //_5
. * mixed outcome t warmth physical_punishment || _all: R.country || _all: R.id
.     
. * est store crossed1
. //_6
. mixed outcome t warmth physical_punishment || _all: R.country || id:
{res}
{txt}Performing EM optimization ...
{res}
{txt}Performing gradient-based optimization: {res}
{txt}Iteration 0:{space 3}log likelihood = {res:-28554.574}  
Iteration 1:{space 3}log likelihood = {res:-28554.549}  
Iteration 2:{space 3}log likelihood = {res:-28554.549}  
{res}
{txt}Computing standard errors ...
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}     9,000

{txt}{col 9}Grouping information
{col 9}{hline 16}{c TT}{hline 44}
{col 25}{c |}{col 31}No. of{col 44}Observations per group
{col 10}Group variable{col 25}{c |}{col 31}groups{col 41}Minimum{col 52}Average{col 63}Maximum
{col 9}{hline 16}{c +}{hline 44}
{res}{col 20}_all{txt}{col 25}{c |}{res}{col 29}       1{col 39}    9,000{col 50}  9,000.0{col 61}    9,000
{col 22}id{txt}{col 25}{c |}{res}{col 29}   3,000{col 39}        3{col 50}      3.0{col 61}        3
{txt}{col 9}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}3{txt}){col 67}={col 70}{res}  1156.04
{txt}Log likelihood = {res}-28554.549{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            outcome{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}t {c |}{col 21}{res}{space 2} .9880161{col 33}{space 2} .0658318{col 44}{space 1}   15.01{col 53}{space 3}0.000{col 61}{space 4} .8589881{col 74}{space 3} 1.117044
{txt}{space 13}warmth {c |}{col 21}{res}{space 2} .9494521{col 33}{space 2} .0383876{col 44}{space 1}   24.73{col 53}{space 3}0.000{col 61}{space 4} .8742138{col 74}{space 3}  1.02469
{txt}physical_punishment {c |}{col 21}{res}{space 2}-.9247961{col 33}{space 2} .0501648{col 44}{space 1}  -18.44{col 53}{space 3}0.000{col 61}{space 4}-1.023117{col 74}{space 3}-.8264749
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}  51.4432{col 33}{space 2} .4233657{col 44}{space 1}  121.51{col 53}{space 3}0.000{col 61}{space 4} 50.61342{col 74}{space 3} 52.27299
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}_all{txt}: Identity{col 30}{c |}
{col 15}var(R.country){col 30}{c |}{res}{col 33} 3.672826{col 44} .9942325{col 58}  2.16063{col 70} 6.243387
{txt}{hline 29}{c +}{hline 48}
{res}id{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33}   9.0953{col 44} .4874893{col 58} 8.188312{col 70} 10.10275
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} 26.00112{col 44} .4747689{col 58} 25.08704{col 70}  26.9485
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}1348.94{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}.     
. est store crossed2 // store crossed effects result
{txt}
{com}. //_7
. mixed outcome t warmth physical_punishment || country: || id:  // 3 level w/ random intercepts only
{res}
{txt}Performing EM optimization ...
{res}
{txt}Performing gradient-based optimization: {res}
{txt}Iteration 0:{space 3}log likelihood = {res:-28554.574}  
Iteration 1:{space 3}log likelihood = {res:-28554.549}  
Iteration 2:{space 3}log likelihood = {res:-28554.549}  
{res}
{txt}Computing standard errors ...
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}     9,000

{txt}{col 9}Grouping information
{col 9}{hline 16}{c TT}{hline 44}
{col 25}{c |}{col 31}No. of{col 44}Observations per group
{col 10}Group variable{col 25}{c |}{col 31}groups{col 41}Minimum{col 52}Average{col 63}Maximum
{col 9}{hline 16}{c +}{hline 44}
{res}{col 17}country{txt}{col 25}{c |}{res}{col 29}      30{col 39}      300{col 50}    300.0{col 61}      300
{col 22}id{txt}{col 25}{c |}{res}{col 29}   3,000{col 39}        3{col 50}      3.0{col 61}        3
{txt}{col 9}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}3{txt}){col 67}={col 70}{res}  1156.04
{txt}Log likelihood = {res}-28554.549{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            outcome{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}t {c |}{col 21}{res}{space 2} .9880161{col 33}{space 2} .0658318{col 44}{space 1}   15.01{col 53}{space 3}0.000{col 61}{space 4} .8589881{col 74}{space 3} 1.117044
{txt}{space 13}warmth {c |}{col 21}{res}{space 2} .9494521{col 33}{space 2} .0383876{col 44}{space 1}   24.73{col 53}{space 3}0.000{col 61}{space 4} .8742138{col 74}{space 3}  1.02469
{txt}physical_punishment {c |}{col 21}{res}{space 2}-.9247961{col 33}{space 2} .0501648{col 44}{space 1}  -18.44{col 53}{space 3}0.000{col 61}{space 4}-1.023117{col 74}{space 3}-.8264749
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}  51.4432{col 33}{space 2} .4233657{col 44}{space 1}  121.51{col 53}{space 3}0.000{col 61}{space 4} 50.61342{col 74}{space 3} 52.27299
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}{hline 29}{c TT}{hline 48}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}Std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}country{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33} 3.672826{col 44} .9942325{col 58}  2.16063{col 70} 6.243387
{txt}{hline 29}{c +}{hline 48}
{res}id{txt}: Identity{col 30}{c |}
{space 18}var(_cons) {c |}{res}{col 33}   9.0953{col 44} .4874893{col 58} 8.188312{col 70} 10.10275
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} 26.00112{col 44} .4747689{col 58} 25.08704{col 70}  26.9485
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}chi2({res}2{txt}) = {res}1348.94{col 59}{txt}Prob > chi2 ={col 73}{res}0.0000

{txt}{p 0 6 4}Note: {help j_mixedlr##|_new:LR test is conservative} and provided only for reference.{p_end}

{com}.     
. est store threelevel // store random intercept model
{txt}
{com}. //_8
. est table threelevel crossed2, ///
> b(%9.3f) star stats(N ll chi2) ///
> varwidth(20) modelwidth(15)
{res}
{txt}{hline 20}{c -}{c TT}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{ralign 20:Variable} {c |} {center 18:threelevel} {space 1} {center 18:crossed2} {space 1}
{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}outcome              {txt}{c |}{res}
{txt}{space 19}t {c |}{res} {ralign 15:0.988}{lalign 3:***}{txt} {space 1}{res} {ralign 15:0.988}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 14}warmth {c |}{res} {ralign 15:0.949}{lalign 3:***}{txt} {space 1}{res} {ralign 15:0.949}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 1}physical_punishment {c |}{res} {ralign 15:-0.925}{lalign 3:***}{txt} {space 1}{res} {ralign 15:-0.925}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 15}_cons {c |}{res} {ralign 15:51.443}{lalign 3:***}{txt} {space 1}{res} {ralign 15:51.443}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lns1_1_1             {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:0.650}{lalign 3:***}{txt} {space 1}{res} {ralign 15:0.650}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lns2_1_1             {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:1.104}{lalign 3:***}{txt} {space 1}{res} {ralign 15:1.104}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lnsig_e              {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:1.629}{lalign 3:***}{txt} {space 1}{res} {ralign 15:1.629}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{lalign 20:Statistics}{txt} {c |} {center 18:} {space 1} {center 18:} {space 1}
{res}{txt}{ralign 20:N} {c |}{res} {ralign 15:9000}{lalign 3:}{txt} {space 1}{res} {ralign 15:9000}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 20:ll} {c |}{res} {ralign 15:-2.86e+04}{lalign 3:}{txt} {space 1}{res} {ralign 15:-2.86e+04}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 20:chi2} {c |}{res} {ralign 15:1156.045}{lalign 3:}{txt} {space 1}{res} {ralign 15:1156.045}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c BT}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{ralign 64:Legend: * p<0.05; ** p<0.01; *** p<0.001}
{res}{txt}
{com}. //_9
. 
. keep if family <= 5 // random sample of families
{txt}(8,550 observations deleted)

{com}.     
. quietly mixed outcome t warmth physical_punishment || _all: R.country || _all: R.id
{txt}
{com}.     
. est store crossed1A // less efficient syntax
{txt}
{com}.     
. quietly mixed outcome t warmth physical_punishment || _all: R.country || id:
{txt}
{com}.     
. est store crossed2A // more efficient syntax
{txt}
{com}.     
. est table crossed1A crossed2A, ///
> b(%9.3f) star stats(N ll chi2) ///
> varwidth(20) modelwidth(15)
{res}
{txt}{hline 20}{c -}{c TT}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{ralign 20:Variable} {c |} {center 18:crossed1A} {space 1} {center 18:crossed2A} {space 1}
{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}outcome              {txt}{c |}{res}
{txt}{space 19}t {c |}{res} {ralign 15:1.222}{lalign 3:***}{txt} {space 1}{res} {ralign 15:1.222}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 14}warmth {c |}{res} {ralign 15:0.854}{lalign 3:***}{txt} {space 1}{res} {ralign 15:0.854}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 1}physical_punishment {c |}{res} {ralign 15:-1.214}{lalign 3:***}{txt} {space 1}{res} {ralign 15:-1.214}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 15}_cons {c |}{res} {ralign 15:51.616}{lalign 3:***}{txt} {space 1}{res} {ralign 15:51.616}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lns1_1_1             {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:0.649}{lalign 3:*}{txt} {space 1}{res} {ralign 15:0.649}{lalign 3:*}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lns1_2_1             {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:1.132}{lalign 3:***}{txt} {space 1}{res} {ralign 15:}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lnsig_e              {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:1.716}{lalign 3:***}{txt} {space 1}{res} {ralign 15:1.716}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{txt}{res}lns2_1_1             {txt}{c |}{res}
{txt}{space 15}_cons {c |}{res} {ralign 15:}{lalign 3:}{txt} {space 1}{res} {ralign 15:1.132}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c +}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{res}{lalign 20:Statistics}{txt} {c |} {center 18:} {space 1} {center 18:} {space 1}
{res}{txt}{ralign 20:N} {c |}{res} {ralign 15:450}{lalign 3:}{txt} {space 1}{res} {ralign 15:450}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 20:ll} {c |}{res} {ralign 15:-1469.923}{lalign 3:}{txt} {space 1}{res} {ralign 15:-1469.923}{lalign 3:}{txt} {space 1}
{res}{txt}{ralign 20:chi2} {c |}{res} {ralign 15:58.301}{lalign 3:}{txt} {space 1}{res} {ralign 15:58.301}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 20}{c -}{c BT}{c -}{hline 18}{c -}{c -}{c -}{hline 18}{c -}{c -}
{ralign 64:Legend: * p<0.05; ** p<0.01; *** p<0.001}
{res}{txt}
{com}.     
. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/multilevel-workshop/multilevel-workshop2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Apr 2023, 10:50:49
{txt}{.-}
{smcl}
{txt}{sf}{ul off}